#!/bin/bash
set -euo pipefail

red=$(tput setaf 1)
green=$(tput setaf 2)
yellow=$(tput setaf 3)
reset=$(tput sgr0)

clear
cat << EOF

   ____            _         ____  _          _ _     ____            _       _     _ 
  | __ )  __ _ ___| |__     / ___|| |__   ___| | |   / ___|  ___ _ __(_)_ __ | |_  | |
  |  _ \ / _\` / __| '_ \    \___ \| '_ \ / _ \ | |   \___ \ / __| '__| | '_ \| __| | |
  | |_) | (_| \__ \ | | |    ___) | | | |  __/ | |    ___) | (__| |  | | |_) | |_  |_|
  |____/ \__,_|___/_| |_|   |____/|_| |_|\___|_|_|   |____/ \___|_|  |_| .__/ \__| (_)



7. 기초편을 마치며...

  - 결과를 얻는 방법은 한 가지가 아니다
  - 자주 쓰는 명령어 옵션을 활용하고 익숙해지면 명령어 또는 옵션의 사용 범위를 넓혀나가자
			


EOF

echo -n "Next 기초편 종료 y/n : "
read A
[ ${A} == y ] && ./main.sh || ./main.sh
