#!/bin/bash
set -euo pipefail

red=$(tput setaf 1)
green=$(tput setaf 2)
yellow=$(tput setaf 3)
reset=$(tput sgr0)

clear
cat << EOF

   ____            _         ____  _          _ _     ____            _       _     _ 
  | __ )  __ _ ___| |__     / ___|| |__   ___| | |   / ___|  ___ _ __(_)_ __ | |_  | |
  |  _ \ / _\` / __| '_ \    \___ \| '_ \ / _ \ | |   \___ \ / __| '__| | '_ \| __| | |
  | |_) | (_| \__ \ | | |    ___) | | | |  __/ | |    ___) | (__| |  | | |_) | |_  |_|
  |____/ \__,_|___/_| |_|   |____/|_| |_|\___|_|_|   |____/ \___|_|  |_| .__/ \__| (_)



3. 초간단 쉘 스크립트
  - 명령어 연속 실행
    - 파이프라인 ( | )
    - 세미콜론 ( ; )
    - AND 조건 ( && )
    - OR 조건 ( || )
        
  - 한 줄 스크립트

EOF

echo -n "Next 명령어 연속 실행 y/n : "
read A
[ ${A} == y ] && ./3/3-0-0.sh || ./main.sh
