#!/bin/bash
set -euo pipefail

red=$(tput setaf 1)
green=$(tput setaf 2)
yellow=$(tput setaf 3)
reset=$(tput sgr0)

clear
cat << EOF

   ____            _         ____  _          _ _     ____            _       _     _ 
  | __ )  __ _ ___| |__     / ___|| |__   ___| | |   / ___|  ___ _ __(_)_ __ | |_  | |
  |  _ \ / _\` / __| '_ \    \___ \| '_ \ / _ \ | |   \___ \ / __| '__| | '_ \| __| | |
  | |_) | (_| \__ \ | | |    ___) | | | |  __/ | |    ___) | (__| |  | | |_) | |_  |_|
  |____/ \__,_|___/_| |_|   |____/|_| |_|\___|_|_|   |____/ \___|_|  |_| .__/ \__| (_)



1. 리눅스와 쉘

  - 리눅스의 종류

    - 리눅스 배포판
      - 데비안 계열 : 우분투, 민트, 칼리 등
      - 슬랙웨어 계열 : 오픈수세
      - 젠투 
      - 레드햇 계열 : ${red}페도라${reset}, ${red}CentOS${reset}

    - 맥OS는Unix BSD계열
			












EOF

echo -n "Next 쉘의 종류 y/n : "
read A
[ ${A} == y ] && ./1/1-1.sh || ./1/1.start.sh
