#!/bin/bash
set -euo pipefail

red=$(tput setaf 1)
green=$(tput setaf 2)
yellow=$(tput setaf 3)
reset=$(tput sgr0)

clear
cat << EOF

   ____            _         ____  _          _ _     ____            _       _     _ 
  | __ )  __ _ ___| |__     / ___|| |__   ___| | |   / ___|  ___ _ __(_)_ __ | |_  | |
  |  _ \ / _\` / __| '_ \    \___ \| '_ \ / _ \ | |   \___ \ / __| '__| | '_ \| __| | |
  | |_) | (_| \__ \ | | |    ___) | | | |  __/ | |    ___) | (__| |  | | |_) | |_  |_|
  |____/ \__,_|___/_| |_|   |____/|_| |_|\___|_|_|   |____/ \___|_|  |_| .__/ \__| (_)



1. 리눅스와 쉘

  - 리눅스의 종류

  - 쉘의 종류

  - GUI와 CLI

  - 유용한 Bash 커맨드라인 ${red}단축키${reset}
    - Tab, ctrl + a/c/e/r
			













EOF

echo -n "Next 리눅스의 종류 y/n : "
read A
[ ${A} == y ] && ./1/1-0.sh || ./main.sh
