#!/bin/bash
set -euo pipefail

red=$(tput setaf 1)
green=$(tput setaf 2)
yellow=$(tput setaf 3)
reset=$(tput sgr0)

clear
cat << EOF

   ____            _         ____  _          _ _     ____            _       _     _ 
  | __ )  __ _ ___| |__     / ___|| |__   ___| | |   / ___|  ___ _ __(_)_ __ | |_  | |
  |  _ \ / _\` / __| '_ \    \___ \| '_ \ / _ \ | |   \___ \ / __| '__| | '_ \| __| | |
  | |_) | (_| \__ \ | | |    ___) | | | |  __/ | |    ___) | (__| |  | | |_) | |_  |_|
  |____/ \__,_|___/_| |_|   |____/|_| |_|\___|_|_|   |____/ \___|_|  |_| .__/ \__| (_)


0. 오리엔테이션

  - ${green}대상${reset}은 누구인가

  - ${green}무엇${reset}을 배우는가
  
  - ${green}어디${reset}에서 쓸 수 있는가

  - ${green}어떻게${reset} 배우는가















EOF

echo -n "Next 대상은 누구인가 y/n : "
read A
[ ${A} == y ] && ./0/0-0.sh || ./main.sh
