#!/bin/bash
set -euo pipefail

red=$(tput setaf 1)
green=$(tput setaf 2)
yellow=$(tput setaf 3)
reset=$(tput sgr0)

clear
cat << EOF

   ____            _         ____  _          _ _     ____            _       _     _ 
  | __ )  __ _ ___| |__     / ___|| |__   ___| | |   / ___|  ___ _ __(_)_ __ | |_  | |
  |  _ \ / _\` / __| '_ \    \___ \| '_ \ / _ \ | |   \___ \ / __| '__| | '_ \| __| | |
  | |_) | (_| \__ \ | | |    ___) | | | |  __/ | |    ___) | (__| |  | | |_) | |_  |_|
  |____/ \__,_|___/_| |_|   |____/|_| |_|\___|_|_|   |____/ \___|_|  |_| .__/ \__| (_)



2. 리눅스 명령어

  - 실습 환경

  - 자주 사용하는 명령어
    - 파일/프로세스/네트워크/검색/탐색/IO/User 관련

  - 실무에 ${green}유용한 명령어 옵션${reset}













EOF

echo -n "Next 실습환경 y/n : "
read A
[ ${A} == y ] && ./2/2-0.sh || ./main.sh
